{
  "region": "ankle",
  "title": "Ankle Region",
  "source_file": "Ankle Region.docx",
  "extracted_at": "2026-02-04T02:45:34.799Z",
  "conditions": [],
  "raw_text": "General Questions:\n\n\n\nWhat region is pain present in?\n\nHeel \n\nHeel/sole of foot\n\nAnkle\n\nMalleolus\n\nWhen do you feel the pain?\n\na. Morning\n\nb. Noon\n\nc. Night\n\nd. Every time\n\nDo you experience ankle joint stiffness?\n\na. Yes\t\t(Rule out osteoarthritis)\n\nb. No\n\nIf yes, when?\n\na. Morning\t(Confirm osteoarthritis)\n\nb. Noon\n\nc. Night\n\nd. Anytime\n\ne. Every time\n\n\n\nFor Achilles Tendinopathy (Tendinitis)\n\nDo you feel the pain about 4 cm above your heel?\n\nYes\n\nNo\n\nHow did the pain begin \n\nSudden \t\t(Rule out achilles tendon rupture)\n\nGradual\n\nWhat type of pain do you feel?\n\nDull and aching\n\nSharp and pinching\t\t(Rule out tarsal tunnel syndrome)\n\nIs there evidence of inflammation around the heel?\n\nYes\n\nNo\n\nDo you experience pain during push-off phase of walking?\n\nYes\n\nNo\n\nDoes the pain reduce with rest at joint or with the use of NSAIDs?\n\nYes\n\nNo\n\nRadiographic confirmation\n\nUse ultrasound to investigate tears\n\n\n\nFor Achilles Tendon Rupture\n\nDo you feel the pain about 5cm from your heel?\n\nYes\n\nNo\n\nDo you engage in sports requiring heavy push-offs such as: squash, badminton, football, tennis, netball?\n\nYes\n\nNo\n\nHave you had a previous history of tendinitis?\n\nYes\n\nNo\n\nDid you hear a ripping or popping sensation accompanying the pain at onset?\n\nYes\n\nNo\n\nDid you feel like someone hit you on the heel at the onset of the pain?\n\nYes\n\nNo\n\nHave you self-medicated with local corticosteroids before?\n\nYes\n\nNo\n\nTEST\n\nCheck if plantarflexion of the ankle is weak.\n\nCheck for palpable gap at the site of the rupture\n\nThompson’s or Simmond’s Test: Patient lies prone and the calf is squeezed. If tendon is ruptured, the foot will remain still when it ought to contract involuntarily.\n\nRadiographic Imaging: Use ultrasound to confirm the diagnosis.\n\n\n\n\n\n\n\n\n\nFor Traction Apophysitis (Sever’s Disease) … \n\nAge ( About 10 yrs)\n\nSex\n\nMale\n\nFemale\n\nIs pain and tenderness localised to the insertion of the Tendon Achilles?\n\nYes\n\nNo\n\nTEST\n\nRadiographic confirmation:\n\nCheck for density of apophysitis and check for fragmentation of the apophysitis.\n\n\n\nFor Calcaneal Bursitis (Confirmation)\n\nAge ( 65 years and older)\n\nSex\n\nFemale\t\t(NB: Can occur in younger females)\n\nMale\n\nWhere do you feel the pain?\n\nHeel\n\nAnkle\n\nDo you have painful bumps on your heel?\n\nYes\n\nNo\n\nDo you experience this more during cold weather times?\n\nYes \n\nNo\n\nDo you wear high-heeled shoes?\n\nYes\n\nNo\n\nObservation:\n\nDoes the posterior portion of the calcaneum look more prominent?\n\n\n\n\n\n\n\nFor Plantar Fasciitis (Confirmation)\n\nDo you experience pain on heel or sole with standing and/or walking?\n\nYes \n\nNo\n\nIs this pain most prominent at the heel?\n\nYes\n\nNo\n\nIs the onset of pain sudden or gradual?\n\nSudden \t\t(Ask if patient has just recently changed their footwear)\n\nGradual\n\nIs pain worse when you first get up in the morning?\n\nYes\t(Though this is not in every case)\n\nNo\n\nDo you feel the pain more when you get up after you have been sitting for a long time?\n\nYes\n\nNo\n\nIs there tenderness at the medial aspect beneath the heel / mid-foot?\n\nYes\n\nNo\n\nTEST\n\nConfirmation using ultrasound to check for thickening around the heel.\n\nDoppler test to show increased local blood flow and neovascularisation\n\n\n\n\n\nFOR ANKLE LIGAMENT INJURIES\n\n\n\nDid you stumble on a stairway, potholes or pavement before the onset of pain?\n\nYes\n\nNo\n\nHave you experienced any twisting or wrenching movement at your ankle joint?\n\nYes \t\t(Rule out fracture)\n\nNo\n\nCan you walk with the affected foot and bear weight on it?\n\nYes\n\nNo\t\t(Confirm fracture)\n\nIs bruise at sight of injury faint and did it appear slowly?\n\nYes\n\nNo\n\nFor Acute Injury of Lateral Ligaments\n\nIs severe pain felt on slight attempt to invert (turn inward) foot?\n\nYes\n\nNo\n\nObservation\n\nPalpate the ankle, distally and anteriorly to the lateral malleolus and ask if patient feels more pain. Usually, patient feels more pain on palpation.\n\n\n\nRadiographic Confirmation\n\nRule out undisplaced fracture of Fibula, tarsal bone, 5th metatarsal bone\n\n\n\nFor Recurrent Lateral Instability\n\nHave you had a past episode of an ankle sprain?\n\nYes\n\nNo \n\nIf yes, have you had experiences like your ankle giving way OR instability when walking on uneven surfaces?\n\nYes \n\nNo\t\t(proceed to special test either ways)\n\nTESTS\n\nSpecial Test for Recurrent Lateral Instability\n\nTalar tilt test: The ankle is held in the neutral position, examiner stabilised the tibia just above the ankle and then tries to force the ankle into maximum inversion. The ROM can be measured or compared with the contralateral side.Inversion laxity suggests injury to calcaneofibular and anterior talofibular ligaments (ATFL).\n\nAnterior Drawer Test: Patient sits with knee flexed at 90 deg and ankle in plantarflexion of about 10 deg. The lower leg is stabilised by the examiner and the force patient’s heel forward over the tibia. If positive, the talus can be felt sliding forwards and backwards. Laxity indicates tear of the ATFL.\n\n\n\nFor Deltoid Ligament Tear:\n\nDo you have a previous history of fibular fracture?\n\nYes\n\nNo\n\nObservation\n\nCheck if foot is everted and externally rotated.\n\nRadiographic confirmation\n\nCheck for widening of the medial joint space in the mortise view, check if talus is tilted, check for fracture or dislocation of the proximal fibula.\n\n\n\nFor Tears of Inferior Tibiofibular Ligaments:\n\nDid you have an injury that twisted your ankle?\n\nYes\n\nNo\n\nDo you feel pains in front of your ankle?\n\nYes\n\nNo\n\nIs swelling and marked tenderness present directly over the inferior tibiofibular joint?\n\nYes\n\nNo \t\t(Rule out fracture)\n\n\n\nTEST\n\nSqueeze Test: Compress the leg firmly above the ankle. Test is positive if pain is felt over the syndesmosis.\n\n\n\n\n\nFOR MALLEOLAR FRACTURES OF THE ANKLE\n\n\n\nAge (Postmenopausal women)\n\nDo you play sports? \n\nYes\n\nNo   \n\nAny history of fall prior to the onset of the injury?\n\nYes\n\nNo\n\nDid you experience any twisting injury with your ankle going into inversion?\n\nYes\n\nNo\n\nDid you experience a fall with your foot anchored to the ground while your body fell forward?\n\nYes\n\nNo\n\nIs any obvious deformity present in the ankle?\n\nYes\n\nNo\n\nFollowing the onset of the pain are you able to stand and bear weight on the affected part?\n\nYes\n\nNo\n\nTEST\n\nConfirm fracture using radiographic imaging\n\n\n\nFOR CALCANEAL FRACTURES\n\nIs the patient osteoporotic?\n\nYes\n\nNo\t\t\n\nDid you experience a fall from a height?\n\nYes\n\nNo \n\nWere you involved in a road traffic accident?\n\nYes\n\nNo\n\nIs your foot painful and swollen?\n\nYes\n\nNo\n\nDoes the heel look broad and wide\n\nYes\n\nNo\n\nIs the surrounding tissue around the heel thick and tender?\n\nYes\n\nNo\n\nIs the normal concavity (hollow) below the lateral malleolus lacking?\n\nYes\n\nNo\n\nCan you invert (turn inward) and evert (turn outward) your foot?\n\nYes\n\nNo\n\nRule out foot compartment syndrome.\n\nTEST\n\nRadiographic Confirmation\n\n\n\n\n\n\n\n\n\nFor Foot Compartment Syndrome?\n\nDo you feel intense pain in the foot?\n\nYes\n\nNo\n\nIs bruising and swelling extensive?\n\nYes\n\nNo\n\nIs sensation diminished at the foot?\n\nYes\n\nNo\n\nDo you experience pain on the dorsiflexion of the toes?\n\nYes\t\t(Refer for laboratory confirmation)\n\nNo\n\nObservations\n\nCheck if two-point discrimination is present.\n\nCheck if pain is present on passive movement of the toes\n\n\n\nRHEUMATOID ARTHRITIS\n\nAt Forefoot\n\nDo you feel uncomfortable when you wear your shoes?\n\nYes\n\nNo\n\nSince the onset of this discomfort, do you walk less due to the discomfort?\n\nYes\n\nNo\n\nDo you feel pain at your metatarsophalangeal joint (forefoot)?\n\nYes\n\nNo\n\nIs the region of the metatarsophalangeal joint (forefoot) swollen?\n\nYes\n\nNo\n\nIs there tenderness at the metatarsaophalangeal joint (forefoot)?\n\nYes\n\nNo\n\nDo you feel pain when you press or squeeze the forefoot?\n\nYes\n\nNo\n\nDid this pain progress to the entire foot?\n\nYes\n\nNo\n\nDo you experience weakness of your foot muscles?\n\nYes\n\nNo\n\nObservation\n\nCheck for the following deformities\n\nA flattenened anterior arch\n\nHallux valgus\n\nClaw toes\n\nProminence of the metatarsal head in the soles (Feels like walking on stones)\n\nPresence of subcutaneous nodules\n\nRadiographic confirmation\n\n\tCheck for osteoporosis, and periarticular erosion at the metatarsophalangeal joint.\n\n\n\nFor RA of Ankle and Hindfoot\n\nDo you find it increasingly difficult to walk?\n\nYes\n\nNo\n\nDo you experience pain around your ankle?\n\nYes\n\nNo\n\nIs swelling and tenderness present behind the lateral and/or medial malleolus?\n\nYes\n\nNo\n\nDo you find it painful to invert (turn inward) and evert (turn outward) your foot?\n\nYes\n\nNo\n\nDo you find the range of movement limited when you try to invert (turn inward) and evert (turn outward) your foot??\n\nYes \n\nNo\n\nIs a valgus deformity (turning outward of the foot) present?\n\nYes\n\nNo\n\n\n\nTEST\n\nRadiographic confirmation. Check for osteoporosis, erosion of the tarsal and ankle joints and the swelling of soft-tissues.\n\n\n\nOSTEOARTHRITIS\n\nHave you had a previous diagnosis of osteoarthritis of other joints?\n\nYes\n\nNo\n\nDo you have any previous history of the following: malunited fracture, recurrent instability, and avascular necrosis of the talus?\n\nYes\n\nNo\n\nDo you experience pain and stiffness at the ankle joint? *\n\nYes\n\nNo\n\nDo you notice this pain more when standing up from rest?\n\nYes\n\nNo\n\nIs the ankle swollen?\n\nYes\n\nNo\n\nDo you experience limitation when bringing the foot upward towards (dorsiflexion) and pushing the foot downward away (plantar flexion) from the shin?\n\nYes\n\nNo\n\nObsevation\n\nCheck if there:\n\nare palpable anterior osteophytes present at the ankle joint\n\nis tenderness present along the anterior joint line.\n\nis an antalgic gait?\n\nis outward turning of the foot as patient walks?\n\nTEST\n\nRadiographic confirmation – check for joint space narrowing, osteophytes formation, subchondral sclerosis, and cyst formation.\n\n\n\n\n\n\n\nFor Tarsal Tunnel Syndrome\n\nDo you feel numbness, burning and tingling sensation in your foot and/or medial portion of your ankle?\n\nYes\n\nNo\n\nDo you experience weakness in your foot muscles (toe abductors and flexors)?\n\nYes\n\nNo\n\nDo you have a previous history of diabetes or osteoarthritis?\n\nYes\n\nNo\n\nDoes your job or daily task involve running, excessive walking and standing?\n\nYes\n\nNo\n\nDo you have a previous history of trauma or dislocation at ankle region?\n\nYes\n\nNo\n\nIs tenderness present behind the medial malleolus?\n\nYes\n\nNo\n\nDo the symptoms you feel worsen with a forceful eversion (turning outward) of the foot OR dorsiflexion (moving foot upwards towards the shin)?\n\nYes\n\nNo\n\nDo you feel a stabbing pain in the medial sole of your foot while walking?\n\nYes\n\nNo\n\nDoes the pain get aggravated with walking?\n\nYes\n\nNo\n\nDo you feel night pain that wake you up from sleep?\n\nYes\n\nNo\n\n\n\nObservation\n\nCheck for atrophy of the abductor hallucis\n\nCheck for arch stability\n\nCheck for the position of the talus and calcaneus\n\nTESTS\n\nTinel’s sign: Percussion of the tarsal tunnel. Positive if this results in a distal radiation of paraesthesia\n\nDorsiflexion-Eversion Test: Place the patient’s foot into dorsiflexion and eversion and hold for 5-10 seconds. Positive if patient’s symptom is elicited.\n\n",
  "extraction_messages": []
}